//
//  MarketDataModel.swift
//  CryptoProBootcamp
//
//  Created by Kasharin Mikhail on 21.07.2023.
//

import Foundation

// JSON Data
/*
 URL: https://api.coingecko.com/api/v3/global
 
 JSON Response:
 
 {
   "data": {
     "active_cryptocurrencies": 10012,
     "upcoming_icos": 0,
     "ongoing_icos": 49,
     "ended_icos": 3376,
     "markets": 777,
     "total_market_cap": {
       "btc": 41799420.19241104,
       "eth": 658834195.7417874,
       "ltc": 13476489040.057707,
       "bch": 5098930570.498946,
       "bnb": 5119767156.052184,
       "eos": 1611485669335.6448,
       "xrp": 1575855209646.8147,
       "xlm": 7453530601942.986,
       "link": 150954226049.68176,
       "dot": 221083339345.17526,
       "yfi": 181119804.56254956,
       "usd": 1249906762580.297,
       "aed": 4591032529633.678,
       "ars": 335753204321901.8,
       "aud": 1845286099961.031,
       "bdt": 135681999983392.39,
       "bhd": 471256096415.93536,
       "bmd": 1249906762580.297,
       "brl": 5997677600241.538,
       "cad": 1646014714709.619,
       "chf": 1082641739798.2759,
       "clp": 1024513739635501.1,
       "cny": 8962581431758.273,
       "czk": 26901117047727.684,
       "dkk": 8361501269633.41,
       "eur": 1122395024382.1433,
       "gbp": 970696340421.2987,
       "hkd": 9767083919493.1,
       "huf": 428294828633182,
       "idr": 18776730604145276,
       "ils": 4515506913504.778,
       "inr": 102548666580958.89,
       "jpy": 175185369459801,
       "krw": 1601581842951896.5,
       "kwd": 383613884130.5691,
       "lkr": 410235109556952.25,
       "mmk": 2625058292464574,
       "mxn": 21111988890636.168,
       "myr": 5690200536646.784,
       "ngn": 975114830821796.8,
       "nok": 12574397006570.172,
       "nzd": 2007415255855.6094,
       "php": 68328025536782.24,
       "pkr": 357718492060284.2,
       "pln": 4996431038729.282,
       "rub": 113011461103571.66,
       "sar": 4688567753944.894,
       "sek": 12923442219368.02,
       "sgd": 1658501283267.7952,
       "thb": 42840554287439.62,
       "try": 33520700756572.195,
       "twd": 39041213951131.12,
       "uah": 46166137463900.234,
       "vef": 125153164137.16498,
       "vnd": 29566097694664240,
       "zar": 22386532565413.668,
       "xdr": 928325751076.5883,
       "xag": 50335532695.779106,
       "xau": 634302683.87425,
       "bits": 41799420192411.04,
       "sats": 4179942019241104.5
     },
     "total_volume": {
       "btc": 1587308.5576497288,
       "eth": 25018843.61456006,
       "ltc": 511761796.7399489,
       "bch": 193628909.0173608,
       "bnb": 194420166.1785513,
       "eos": 61195226672.8039,
       "xrp": 59842180785.64249,
       "xlm": 283043469376.0714,
       "link": 5732398528.952667,
       "dot": 8395510628.639984,
       "yfi": 6877918.74668581,
       "usd": 47464478965.86325,
       "aed": 174341777689.51187,
       "ars": 12750031747455.484,
       "aud": 70073661411.9835,
       "bdt": 5152444667923.1875,
       "bhd": 17895674897.93625,
       "bmd": 47464478965.86325,
       "brl": 227758302317.69412,
       "cad": 62506446994.93497,
       "chf": 41112687461.69347,
       "clp": 38905310620753.73,
       "cny": 340348792872.61884,
       "czk": 1021554201078.3129,
       "dkk": 317523124937.93524,
       "eur": 42622295215.2028,
       "gbp": 36861626332.07394,
       "hkd": 370899304758.9974,
       "huf": 16264245856931.828,
       "idr": 713035373109183.9,
       "ils": 171473736548.00012,
       "inr": 3894225692371.6353,
       "jpy": 6652562041256.678,
       "krw": 60819134652865.914,
       "kwd": 14567513097.328945,
       "lkr": 15578438577632.434,
       "mmk": 99685054787312.78,
       "mxn": 801715442005.03,
       "myr": 216082040492.09174,
       "ngn": 37029415923229.01,
       "nok": 477505378876.9476,
       "nzd": 76230421372.08252,
       "php": 2594716844458.404,
       "pkr": 13584150714605.73,
       "pln": 189736549190.73773,
       "rub": 4291544200767.816,
       "sar": 178045620841.13498,
       "sek": 490760166879.5162,
       "sgd": 62980617139.8039,
       "thb": 1626845016554.9604,
       "try": 1272929024479.2197,
       "twd": 1482567287306.9075,
       "uah": 1753132094482.6655,
       "vef": 4752618278.85188,
       "vnd": 1122755283949345.5,
       "zar": 850115493315.7887,
       "xdr": 35252627959.6101,
       "xag": 1911462442.1602364,
       "xau": 24087273.78559631,
       "bits": 1587308557649.7288,
       "sats": 158730855764972.88
     },
     "market_cap_percentage": {
       "btc": 46.49584916028364,
       "eth": 18.24323125201506,
       "usdt": 6.709702082966759,
       "xrp": 3.338602909997209,
       "bnb": 3.044125507878234,
       "usdc": 2.153309901276101,
       "steth": 1.179859529996251,
       "ada": 0.8885415486825468,
       "sol": 0.8243629052341952,
       "doge": 0.8074140918878392
     },
     "market_cap_change_percentage_24h_usd": -0.1233403801334048,
     "updated_at": 1689911439
   }
 }
 */


/*
еще одна модель для получения данных из интеренета
эти данные отображаются сверху на главном экране как общая статистика
*/
struct GlobalData: Codable {
    let data: MarketDataModel?
}

struct MarketDataModel: Codable {
    let totalMarketCap, totalVolume, marketCapPercentage: [String: Double]
    let marketCapChangePercentage24HUsd: Double

    enum CodingKeys: String, CodingKey {
        case totalMarketCap = "total_market_cap"
        case totalVolume = "total_volume"
        case marketCapPercentage = "market_cap_percentage"
        case marketCapChangePercentage24HUsd = "market_cap_change_percentage_24h_usd"
    }
    
    /*
    здесь мы добавили вычисляемые свойства, для своего собственного отображения данных
    */
    var marketCap: String {
        if let item = totalMarketCap.first(where: { $0.key == "usd"}) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var volime: String {
        if let item = totalVolume.first(where: { $0.key == "usd"}) {
            return "$" + item.value.formattedWithAbbreviations()
        }
        return ""
    }
    
    var btcDominance: String {
        if let item = marketCapPercentage.first(where: { $0.key == "btc"}) {
            return item.value.asPercentString()
        }
        return ""
    }
}
